package Lesson1.P2_Code;

public class main {
    public static void main(String[] args) {

        /* Я с начала декабря плотно сел на PL/SQL (с переходом на новую работу),
        могу что-то упустить.
        Если это незаконченный код, то в принципе можно придраться только к ошибкам
        типа:
        У Lorry попытка наследоваться от трех классов, интерфейсы нужно имплементить.
        Там же не переопределён класс open.
        Не очень понятны уровни доступа к классам, а так же к полям в Car.
        Для обоснования классов-наследников нужно будет, чтобы они ездили, ну, например,
        зиг-загом или "шаг вперед-два назад".

        Если код закончен, помимо ошибок, непонятно назначение классов Lorry и LightWeightCar.
        LightWeightCar - видимо, автомобиль "последнего пути".
        Положили "пассажира", поехал и не останавливается, как у викингов - погребальный драккар.
        Lorry - автоматизированный автомобиль, без водителя.
         */

    }
}
